var railwayStationsChina = {
    "railways": [
        {
            "name": "兰新高铁",
            "id": 1500,
            "level": 250,
            "info": "兰新铁路第二双线，简称兰新二双，又称兰新高铁、兰新客运专线，是中国一条连接甘肃省兰州市与新疆维吾尔自治区乌鲁木齐市的快速铁路。原兰新高铁是铁道部《中长期铁路网规划（2008年调整）》的重点项目。但自723温州动车事故后，铁道部重新审视铁道建设计划。2012年，兰新第二双线在《十二五综合交通运输体系规划》中被列为快速铁路。全线按国铁I级规格建造，设计最高时速为250公里，全长1776公里（运价里程为1787公里）。",
            "stations": [
                {
                    "name": "兰州西高铁站",
                    "info": "甘肃省兰州市七里河区",
                    "location": {
                        "lng": 103.75094571814675,
                        "lat": 36.070940100316214
                    }
                },
                {
                    "name": "民和南站",
                    "info": "青海省海东地区民和回族土族自治县",
                    "location": {
                        "lng": 102.84816685586642,
                        "lat": 36.30648357548181
                    }
                },
                {
                    "name": "乐都南站",
                    "info": "青海省海东地区乐都县",
                    "location": {
                        "lng": 102.38960284581924,
                        "lat": 36.467857007371705
                    }
                },
                {
                    "name": "海东平安站",
                    "info": "青海省海东地区平安县",
                    "location": {
                        "lng": 102.05347224201178,
                        "lat": 36.509512625801065
                    }
                },
                {
                    "name": "西宁站",
                    "info": "青海省西宁市城东区",
                    "location": {
                        "lng": 101.81255342788529,
                        "lat": 36.620273568694934
                    }
                },
                {
                    "name": "大通西站",
                    "info": "青海省西宁市大通回族土族自治县",
                    "location": {
                        "lng": 101.6720369055208,
                        "lat": 36.96574881002178
                    }
                },
                {
                    "name": "门源站",
                    "info": "青海省海北藏族自治州门源回族自治县",
                    "location": {
                        "lng": 101.52633377635107,
                        "lat": 37.42653662417072
                    }
                },
                {
                    "name": "民乐站",
                    "info": "甘肃省张掖市民乐县",
                    "location": {
                        "lng": 100.83748074174365,
                        "lat": 38.47349682821972
                    }
                },
                {
                    "name": "张掖西站",
                    "info": "甘肃省张掖市甘州区",
                    "location": {
                        "lng": 100.42714967822151,
                        "lat": 38.92309009832005
                    }
                },
                {
                    "name": "临泽南站",
                    "info": "甘肃省张掖市临泽县",
                    "location": {
                        "lng": 100.1233371620539,
                        "lat": 39.13344070353456
                    }
                },
                {
                    "name": "高台南站",
                    "info": "甘肃省张掖市高台县",
                    "location": {
                        "lng": 99.7679713898158,
                        "lat": 39.294416291796786
                    }
                },
                {
                    "name": "酒泉清水北站",
                    "info": "甘肃省酒泉市肃州区",
                    "location": {
                        "lng": 99.09656019840648,
                        "lat": 39.37341138416903
                    }
                },
                {
                    "name": "酒泉南站",
                    "info": "甘肃省酒泉市肃州区",
                    "location": {
                        "lng": 98.53486034873347,
                        "lat": 39.70059682607172
                    }
                },
                {
                    "name": "嘉峪关南站",
                    "info": "甘肃省嘉峪关市嘉峪关市市辖区",
                    "location": {
                        "lng": 98.30874916977811,
                        "lat": 39.716720662604054
                    }
                },
                {
                    "name": "玉门火车站",
                    "info": "甘肃省酒泉市玉门市",
                    "location": {
                        "lng": 97.0438856092323,
                        "lat": 40.271436580509814
                    }
                },
                {
                    "name": "柳园南站",
                    "info": "甘肃省酒泉市瓜州县",
                    "location": {
                        "lng": 95.47117235385083,
                        "lat": 41.1012062297568
                    }
                },
                {
                    "name": "哈密站",
                    "info": "新疆维吾尔自治区哈密地区哈密市",
                    "location": {
                        "lng": 93.50514803829775,
                        "lat": 42.84879323679055
                    }
                },
                {
                    "name": "吐哈站",
                    "info": "新疆维吾尔自治区吐鲁番地区鄯善县",
                    "location": {
                        "lng": 90.53006089446946,
                        "lat": 43.05875463553523
                    }
                },
                {
                    "name": "鄯善北站",
                    "info": "新疆维吾尔自治区吐鲁番地区鄯善县",
                    "location": {
                        "lng": 90.19400530501699,
                        "lat": 42.91718306277205
                    }
                },
                {
                    "name": "吐鲁番北站",
                    "info": "新疆维吾尔自治区吐鲁番地区吐鲁番市",
                    "location": {
                        "lng": 89.10812332049005,
                        "lat": 43.020687054881805
                    }
                },
                {
                    "name": "乌鲁木齐南站",
                    "info": "新疆维吾尔自治区乌鲁木齐市沙依巴克区",
                    "location": {
                        "lng": 87.58337727639281,
                        "lat": 43.77909572125787
                    }
                },
                {
                    "name": "乌鲁木齐站",
                    "info": "新疆维吾尔自治区乌鲁木齐市沙依巴克区",
                    "location": {
                        "lng": 87.53167293799774,
                        "lat": 43.83816686495115
                    }
                }

            ]
        }, {
            "name": "京沪高铁",
            "id": 1000,
            "level": 350,
            "info": "京沪高速铁路简称京沪高铁，是中国一条连接北京市与上海市的高速铁路。线路由北京南站至上海虹桥站，全长1318公里，设24个车站。设计的最高速度为380km/h，近期最高运营时速350km/h（2017年9月21日起[1]）。",
            "stations": [
                {
                    "name": "北京南站",
                    "info": "北京市丰台区",
                    "location": {
                        "lng": 116.37341589472283,
                        "lat": 39.86350903443785
                    }
                },
                {
                    "name": "廊坊站",
                    "info": "河北省廊坊市安次区",
                    "location": {
                        "lng": 116.70213578764219,
                        "lat": 39.50832572685988
                    }
                },
                {
                    "name": "天津西站",
                    "info": "天津市红桥区",
                    "location": {
                        "lng": 117.16171414441469,
                        "lat": 39.15524313932219
                    }
                },
                {
                    "name": "德州东站",
                    "info": "山东省德州市陵县",
                    "location": {
                        "lng": 116.45626608412195,
                        "lat": 37.40887927666732
                    }
                },
                {
                    "name": "泰安站",
                    "info": "山东省泰安市岱岳区",
                    "location": {
                        "lng": 117.02890871957644,
                        "lat": 36.171712053966836
                    }
                },
                {
                    "name": "天津南站",
                    "info": "天津市西青区",
                    "location": {
                        "lng": 117.054611441253,
                        "lat": 39.056101349397316
                    }
                },
                {
                    "name": "济南西站",
                    "info": "山东省济南市槐荫区",
                    "location": {
                        "lng": 116.88565909192268,
                        "lat": 36.66850030973334
                    }
                },
                {
                    "name": "沧州西站",
                    "info": "河北省沧州市运河区",
                    "location": {
                        "lng": 116.82942614878368,
                        "lat": 38.36963558182635
                    }
                },
                {
                    "name": "曲阜东站",
                    "info": "山东省济宁市曲阜市",
                    "location": {
                        "lng": 117.06304488076606,
                        "lat": 35.55641636326004
                    }
                },
                {
                    "name": "徐州东站",
                    "info": "江苏省徐州市贾汪区",
                    "location": {
                        "lng": 117.29877618702241,
                        "lat": 34.2686256710706
                    }
                },
                {
                    "name": "枣庄站",
                    "info": "山东省枣庄市薛城区",
                    "location": {
                        "lng": 117.30044871507032,
                        "lat": 34.781127777615964
                    }
                },
                {
                    "name": "宿州东站",
                    "info": "安徽省宿州市埇桥区",
                    "location": {
                        "lng": 117.24545992991249,
                        "lat": 33.67720739408837
                    }
                },
                {
                    "name": "蚌埠南站",
                    "info": "安徽省蚌埠市龙子湖区",
                    "location": {
                        "lng": 117.43646975965807,
                        "lat": 32.903932223830665
                    }
                },
                {
                    "name": "滕州东站",
                    "info": "山东省枣庄市滕州市",
                    "location": {
                        "lng": 117.25176977440859,
                        "lat": 35.09067170885243
                    }
                },
                {
                    "name": "定远站",
                    "info": "安徽省滁州市定远县",
                    "location": {
                        "lng": 117.8363557822558,
                        "lat": 32.57763328180716
                    }
                },
                {
                    "name": "滁州站",
                    "info": "安徽省滁州市琅琊区",
                    "location": {
                        "lng": 118.32170716827193,
                        "lat": 32.30978063012329
                    }
                },
                {
                    "name": "常州北站",
                    "info": "江苏省常州市新北区",
                    "location": {
                        "lng": 119.95053458903337,
                        "lat": 31.855965150012906
                    }
                },
                {
                    "name": "南京南站",
                    "info": "江苏省南京市雨花台区",
                    "location": {
                        "lng": 118.77431279554445,
                        "lat": 32.00779291175553
                    }
                },
                {
                    "name": "丹阳北站",
                    "info": "江苏省镇江市丹阳市",
                    "location": {
                        "lng": 119.66593890569625,
                        "lat": 32.017458927289816
                    }
                },
                {
                    "name": "镇江南站",
                    "info": "江苏省镇江市丹徒区",
                    "location": {
                        "lng": 119.41870631464901,
                        "lat": 32.15446074812003
                    }
                },
                {
                    "name": "昆山南站",
                    "info": "江苏省苏州市昆山市",
                    "location": {
                        "lng": 120.94637944095479,
                        "lat": 31.35483173373471
                    }
                },
                {
                    "name": "苏州北站",
                    "info": "江苏省苏州市相城区",
                    "location": {
                        "lng": 120.63889326574444,
                        "lat": 31.42386888066365
                    }
                },
                {
                    "name": "上海虹桥站",
                    "info": "上海市闵行区",
                    "location": {
                        "lng": 121.31539830377089,
                        "lat": 31.19605366577973
                    }
                },
                {
                    "name": "无锡东站",
                    "info": "江苏省无锡市锡山区",
                    "location": {
                        "lng": 120.45517053327872,
                        "lat": 31.599112403789626
                    }
                }
            ]
        },

        {
            "name": "京广高铁",
            "id": "2000",
            "level": "300",
            "info": "京广高速铁路是中国一条营运中的高速铁路。该线始于北京西站，途经石家庄、郑州、武汉、长沙等地，到达广州南站，全长2,118公里[1]，为目前中国线路里程最长、经过省份最多的南北向高速铁路，也是当今世界上营运里程最长的高速铁路[3]，行车时间最快约为8小时03分钟（北京西-广州南）、3小时43分钟（武汉-广州南）。",
            "stations": [
                {
                    "name": "北京西站",
                    "info": "北京市海淀区",
                    "location": {
                        "lng": 116.31500854711402,
                        "lat": 39.89636758148235
                    }
                },
                {
                    "name": "涿州东站",
                    "info": "河北省保定市涿州市",
                    "location": {
                        "lng": 116.04697707454896,
                        "lat": 39.45838434771772
                    }
                },
                {
                    "name": "高碑店东站",
                    "info": "河北省保定市高碑店市",
                    "location": {
                        "lng": 115.94050459310108,
                        "lat": 39.287687237458215
                    }
                },
                {
                    "name": "保定东站",
                    "info": "河北省保定市清苑县",
                    "location": {
                        "lng": 115.59584091398945,
                        "lat": 38.863498805482735
                    }
                },
                {
                    "name": "定州东站",
                    "info": "河北省保定市定州市",
                    "location": {
                        "lng": 115.06879439904759,
                        "lat": 38.50743850515365
                    }
                },
                {
                    "name": "正定机场站",
                    "info": "河北省石家庄市正定县",
                    "location": {
                        "lng": 114.70378542976962,
                        "lat": 38.25134857628538
                    }
                },
                {
                    "name": "石家庄站",
                    "info": "河北省石家庄市桥东区",
                    "location": {
                        "lng": 114.48447298424401,
                        "lat": 38.041592606704086
                    }
                },
                {
                    "name": "高邑西站",
                    "info": "河北省石家庄市高邑县",
                    "location": {
                        "lng": 114.52569649577549,
                        "lat": 37.62923476464677
                    }
                },
                {
                    "name": "邢台东站",
                    "info": "河北省邢台市邢台县",
                    "location": {
                        "lng": 114.58618725151122,
                        "lat": 37.09044758384728
                    }
                },
                {
                    "name": "邯郸东站",
                    "info": "河北省邯郸市邯郸县",
                    "location": {
                        "lng": 114.5538114887921,
                        "lat": 36.619575088688045
                    }
                },
                {
                    "name": "安阳东站",
                    "info": "河南省安阳市安阳县",
                    "location": {
                        "lng": 114.44759772924037,
                        "lat": 36.08387017518864
                    }
                },
                {
                    "name": "鹤壁东站",
                    "info": "河南省鹤壁市浚县",
                    "location": {
                        "lng": 114.29435104230876,
                        "lat": 35.70611136717561
                    }
                },
                {
                    "name": "新乡东站",
                    "info": "河南省新乡市延津县",
                    "location": {
                        "lng": 113.97390171874828,
                        "lat": 35.31497049411709
                    }
                },
                {
                    "name": "郑州东站",
                    "info": "河南省郑州市金水区",
                    "location": {
                        "lng": 113.77199245336729,
                        "lat": 34.7603110773027
                    }
                },
                {
                    "name": "许昌东站",
                    "info": "河南省许昌市许昌县",
                    "location": {
                        "lng": 113.88063317053746,
                        "lat": 34.04966549354566
                    }
                },
                {
                    "name": "漯河西站",
                    "info": "河南省漯河市源汇区",
                    "location": {
                        "lng": 113.9575472658683,
                        "lat": 33.57466491436984
                    }
                },
                {
                    "name": "驻马店西站",
                    "info": "河南省驻马店市驿城区",
                    "location": {
                        "lng": 113.97410239445635,
                        "lat": 33.00251656775112
                    }
                },
                {
                    "name": "明港东站",
                    "info": "河南省信阳市平桥区",
                    "location": {
                        "lng": 114.0590478598768,
                        "lat": 32.48915489865311
                    }
                },
                {
                    "name": "信阳东站",
                    "info": "河南省信阳市平桥区",
                    "location": {
                        "lng": 114.154525168209,
                        "lat": 32.14624140845865
                    }
                },
                {
                    "name": "孝感北站",
                    "info": "湖北省孝感市大悟县",
                    "location": {
                        "lng": 114.21630049116297,
                        "lat": 31.588419895950484
                    }
                },
                {
                    "name": "武汉站",
                    "info": "湖北省武汉市洪山区",
                    "location": {
                        "lng": 114.41890509702294,
                        "lat": 30.609690365575975
                    }
                },
                {
                    "name": "咸宁北站",
                    "info": "湖北省咸宁市咸安区",
                    "location": {
                        "lng": 114.29599996330622,
                        "lat": 29.901640149976565
                    }
                },
                {
                    "name": "赤壁北站",
                    "info": "湖北省咸宁市赤壁市",
                    "location": {
                        "lng": 113.8946306893051,
                        "lat": 29.738551139916492
                    }
                },
                {
                    "name": "岳阳东站",
                    "info": "湖南省岳阳市岳阳楼区",
                    "location": {
                        "lng": 113.20178115199695,
                        "lat": 29.369052940458904
                    }
                },
                {
                    "name": "汨罗东站",
                    "info": "湖南省岳阳市汨罗市",
                    "location": {
                        "lng": 113.13833946110256,
                        "lat": 28.748813830058463
                    }
                },
                {
                    "name": "长沙南站",
                    "info": "湖南省长沙市雨花区",
                    "location": {
                        "lng": 113.05784539581839,
                        "lat": 28.149924110440974
                    }
                },
                {
                    "name": "株洲西站",
                    "info": "湖南省株洲市天元区",
                    "location": {
                        "lng": 113.06371517141645,
                        "lat": 27.79396115551558
                    }
                },
                {
                    "name": "衡山西站",
                    "info": "湖南省衡阳市衡山县",
                    "location": {
                        "lng": 112.78372057132621,
                        "lat": 27.251158688205848
                    }
                },
                {
                    "name": "衡阳东站",
                    "info": "湖南省衡阳市衡南县",
                    "location": {
                        "lng": 112.70417410891369,
                        "lat": 26.899950279296082
                    }
                },
                {
                    "name": "耒阳西站",
                    "info": "湖南省衡阳市耒阳市",
                    "location": {
                        "lng": 112.78286265531554,
                        "lat": 26.417738473733216
                    }
                },
                {
                    "name": "郴州西站",
                    "info": "湖南省郴州市北湖区",
                    "location": {
                        "lng": 112.96466284996774,
                        "lat": 25.739120114333296
                    }
                },
                {
                    "name": "乐昌东站",
                    "info": "广东省韶关市乐昌市",
                    "location": {
                        "lng": 113.23492990214893,
                        "lat": 25.24143420538097
                    }
                },
                {
                    "name": "韶关站",
                    "info": "广东省韶关市武江区",
                    "location": {
                        "lng": 113.50918169729955,
                        "lat": 24.753385279467867
                    }
                },
                {
                    "name": "英德西站",
                    "info": "广东省清远市英德市",
                    "location": {
                        "lng": 113.34479416980182,
                        "lat": 24.162540511814978
                    }
                },
                {
                    "name": "清远站",
                    "info": "广东省清远市清城区",
                    "location": {
                        "lng": 113.1285739315497,
                        "lat": 23.696629488103195
                    }
                },
                {
                    "name": "广州北站",
                    "info": "广东省广州市越秀区",
                    "location": {
                        "lng": 113.24018413061745,
                        "lat": 23.16219809038686
                    }
                },
                {
                    "name": "广州南站",
                    "info": "广东省广州市番禺区",
                    "location": {
                        "lng": 113.26320928668865,
                        "lat": 22.99073449976934
                    }
                }
            ]
        },
        {
            "name": "沪昆高铁",
            "id": "2500",
            "level": "300",
            "info": "沪昆高速铁路，又名沪昆客运专线，简称沪昆客专、沪昆高铁，是中国一条东西方向的高速铁路，于2016年12月28日全线通车。全线东起上海市，途径浙江省杭州市、江西省南昌市、湖南省长沙市、贵州省贵阳市等省会城市，西到云南省昆明市，全长2266公里，设计时速为350km/h。该线是客运专线，作为“沪昆通道”也是中国2008年调整《中长期铁路网规划》中“四纵四横”铁路快速客运通道之一，以及2016年修订的《中长期铁路网规划》中“八纵八横”高速铁路主通道之一，服务华东沿海地区、华中地区、西南地区。为目前中国线路里程最长、经过省份最多的东西向高速铁路。",
            "stations": [
                {
                    "name": "上海虹桥站",
                    "info": "上海市闵行区",
                    "location": {
                        "lng": 121.31539830377089,
                        "lat": 31.19605366577973
                    }
                },
                {
                    "name": "松江南站",
                    "info": "上海市松江区",
                    "location": {
                        "lng": 121.22576904445462,
                        "lat": 30.98517021139165
                    }
                },
                {
                    "name": "金山北站",
                    "info": "上海市金山区",
                    "location": {
                        "lng": 121.08490606570099,
                        "lat": 30.896357536883738
                    }
                },
                {
                    "name": "嘉善南站",
                    "info": "浙江省嘉兴市嘉善县",
                    "location": {
                        "lng": 120.93081006753532,
                        "lat": 30.790695840101233
                    }
                },
                {
                    "name": "嘉兴南站",
                    "info": "浙江省嘉兴市南湖区",
                    "location": {
                        "lng": 120.79569477873498,
                        "lat": 30.692939577034505
                    }
                },
                {
                    "name": "桐乡站",
                    "info": "浙江省嘉兴市桐乡市",
                    "location": {
                        "lng": 120.56323895944924,
                        "lat": 30.53929688313405
                    }
                },
                {
                    "name": "海宁西站",
                    "info": "浙江省嘉兴市海宁市",
                    "location": {
                        "lng": 120.38639736718781,
                        "lat": 30.440412355688995
                    }
                },
                {
                    "name": "余杭站",
                    "info": "浙江省杭州市余杭区",
                    "location": {
                        "lng": 120.29145631003011,
                        "lat": 30.383196020970956
                    }
                },
                {
                    "name": "杭州东站",
                    "info": "浙江省杭州市江干区",
                    "location": {
                        "lng": 120.20833548965012,
                        "lat": 30.293867301530536
                    }
                },
                {
                    "name": "杭州南站",
                    "info": "浙江省杭州市萧山区",
                    "location": {
                        "lng": 120.28937505177892,
                        "lat": 30.174521978281575
                    }
                },
                {
                    "name": "诸暨站",
                    "info": "浙江省绍兴市诸暨市",
                    "location": {
                        "lng": 120.18050945690332,
                        "lat": 29.729593452249297
                    }
                },
                {
                    "name": "义乌站",
                    "info": "浙江省金华市义乌市",
                    "location": {
                        "lng": 120.03859132822663,
                        "lat": 29.380827669464995
                    }
                },
                {
                    "name": "金华站",
                    "info": "浙江省金华市婺城区",
                    "location": {
                        "lng": 119.6381674980028,
                        "lat": 29.101107573333614
                    }
                },
                {
                    "name": "龙游站",
                    "info": "浙江省衢州市龙游县",
                    "location": {
                        "lng": 119.16059431986798,
                        "lat": 29.007127637453884
                    }
                },
                {
                    "name": "衢州站",
                    "info": "浙江省衢州市柯城区",
                    "location": {
                        "lng": 118.87642711328606,
                        "lat": 28.92645842339505
                    }
                },
                {
                    "name": "江山站",
                    "info": "浙江省衢州市江山市",
                    "location": {
                        "lng": 118.6390752608987,
                        "lat": 28.77501414990943
                    }
                },
                {
                    "name": "玉山南站",
                    "info": "江西省上饶市玉山县",
                    "location": {
                        "lng": 118.28816840607743,
                        "lat": 28.650339434840433
                    }
                },
                {
                    "name": "上饶站",
                    "info": "江西省上饶市信州区",
                    "location": {
                        "lng": 118.00149692562285,
                        "lat": 28.493877323136566
                    }
                },
                {
                    "name": "戈阳站",
                    "info": "江西省上饶市戈阳县",
                    "location": {
                        "lng": 117.43968142074853,
                        "lat": 28.414158678406988
                    }
                },
                {
                    "name": "鹰潭北站",
                    "info": "江西省鹰潭市贵溪市",
                    "location": {
                        "lng": 117.03393236678795,
                        "lat": 28.308808836331924
                    }
                },
                {
                    "name": "抚州东站",
                    "info": "江西省抚州市东乡县",
                    "location": {
                        "lng": 116.61165104086824,
                        "lat": 28.263865385354563
                    }
                },
                {
                    "name": "进贤南站",
                    "info": "江西省南昌市进贤县",
                    "location": {
                        "lng": 116.230062330938,
                        "lat": 28.340659642929165
                    }
                },
                {
                    "name": "南昌西站",
                    "info": "江西省南昌市新建县",
                    "location": {
                        "lng": 115.78792240193005,
                        "lat": 28.626441596416235
                    }
                },
                {
                    "name": "高安站",
                    "info": "江西省宜春市高安市",
                    "location": {
                        "lng": 115.38076218016714,
                        "lat": 28.472665612500464
                    }
                },
                {
                    "name": "新余北站",
                    "info": "江西省新余市渝水区",
                    "location": {
                        "lng": 114.89412429500261,
                        "lat": 27.91393803052142
                    }
                },
                {
                    "name": "宜春站",
                    "info": "江西省宜春市袁州区",
                    "location": {
                        "lng": 114.43187137523468,
                        "lat": 27.793190681496316
                    }
                },
                {
                    "name": "萍乡北站",
                    "info": "江西省萍乡市上栗县",
                    "location": {
                        "lng": 113.84212570839998,
                        "lat": 27.68847371188011
                    }
                },
                {
                    "name": "醴陵东站",
                    "info": "湖南省株洲市醴陵市",
                    "location": {
                        "lng": 113.5725481257952,
                        "lat": 27.718606182054714
                    }
                },
                {
                    "name": "长沙南站",
                    "info": "湖南省长沙市雨花区",
                    "location": {
                        "lng": 113.05784539581839,
                        "lat": 28.149924110440974
                    }
                },
                {
                    "name": "湘潭北站",
                    "info": "湖南省湘潭市岳塘区",
                    "location": {
                        "lng": 112.9359708444375,
                        "lat": 27.971193134975664
                    }
                },
                {
                    "name": "韶山南站",
                    "info": "湖南省湘潭市韶山市",
                    "location": {
                        "lng": 112.54243314356994,
                        "lat": 27.890949875904056
                    }
                },
                {
                    "name": "娄底南站",
                    "info": "湖南省娄底市娄星区",
                    "location": {
                        "lng": 112.00986802083398,
                        "lat": 27.6671972828887
                    }
                },
                {
                    "name": "邵阳北站",
                    "info": "湖南省邵阳市双清区",
                    "location": {
                        "lng": 111.49901352027261,
                        "lat": 27.57734583715945
                    }
                },
                {
                    "name": "新化南站",
                    "info": "湖南省娄底市新化县",
                    "location": {
                        "lng": 111.15512891989262,
                        "lat": 27.65915773644247
                    }
                },
                {
                    "name": "溆浦南站",
                    "info": "湖南省怀化市溆浦县",
                    "location": {
                        "lng": 110.58807381984708,
                        "lat": 27.608950617206204
                    }
                },
                {
                    "name": "怀化南站",
                    "info": "湖南省怀化市鹤城区",
                    "location": {
                        "lng": 109.98860178342713,
                        "lat": 27.516073317757613
                    }
                },
                {
                    "name": "芷江站",
                    "info": "湖南省怀化市芷江侗族自治县",
                    "location": {
                        "lng": 109.65535213257934,
                        "lat": 27.458439278159336
                    }
                },
                {
                    "name": "新晃西站",
                    "info": "湖南省怀化市新晃侗族自治县",
                    "location": {
                        "lng": 109.12139150950951,
                        "lat": 27.383478482937598
                    }
                },
                {
                    "name": "铜仁南站",
                    "info": "贵州省铜仁市碧江区",
                    "location": {
                        "lng": 108.9713973896189,
                        "lat": 27.282357874326944
                    }
                },
                {
                    "name": "三穗站",
                    "info": "贵州省黔东南苗族侗族自治州三穗县",
                    "location": {
                        "lng": 108.64739486103295,
                        "lat": 26.967039397671222
                    }
                },
                {
                    "name": "凯里南站",
                    "info": "贵州省黔东南苗族侗族自治州凯里市",
                    "location": {
                        "lng": 107.88397186030855,
                        "lat": 26.51843347461551
                    }
                },
                {
                    "name": "贵定北站",
                    "info": "贵州省黔南布依族苗族自治州贵定县",
                    "location": {
                        "lng": 107.22832942596966,
                        "lat": 26.59700775944817
                    }
                },
                {
                    "name": "贵阳东站",
                    "info": "贵州省贵阳市南明区",
                    "location": {
                        "lng": 106.73104696292724,
                        "lat": 26.54882919050402
                    }
                },
                {
                    "name": "贵安站",
                    "info": "贵州省贵阳市花溪区",
                    "location": {
                        "lng": 106.49052851176921,
                        "lat": 26.473750202833024
                    }
                },
                {
                    "name": "平坝南站",
                    "info": "贵州省安顺市平坝县",
                    "location": {
                        "lng": 106.2539867092302,
                        "lat": 26.38746904542058
                    }
                },
                {
                    "name": "安顺西站",
                    "info": "贵州省安顺市西秀区",
                    "location": {
                        "lng": 105.8717083983958,
                        "lat": 26.201961586345135
                    }
                },
                {
                    "name": "关岭站",
                    "info": "贵州省安顺市关岭布依族苗族自治县",
                    "location": {
                        "lng": 105.52595850767246,
                        "lat": 25.967156356946575
                    }
                },
                {
                    "name": "普安县站",
                    "info": "贵州省黔西南布依族苗族自治州普安县",
                    "location": {
                        "lng": 104.99094810903404,
                        "lat": 25.72458778986041
                    }
                },
                {
                    "name": "盘州站",
                    "info": "贵州省六盘水市盘县",
                    "location": {
                        "lng": 104.57203031817667,
                        "lat": 25.79774197017115
                    }
                },
                {
                    "name": "富源北站",
                    "info": "云南省曲靖市富源县",
                    "location": {
                        "lng": 104.26794235064965,
                        "lat": 25.71538296772732
                    }
                },
                {
                    "name": "曲靖北站",
                    "info": "云南省曲靖市麒麟区",
                    "location": {
                        "lng": 103.7740287282747,
                        "lat": 25.517649141849567
                    }
                },
                {
                    "name": "嵩明站",
                    "info": "云南省昆明市嵩明县",
                    "location": {
                        "lng": 103.13527317701738,
                        "lat": 25.243122623800343
                    }
                },
                {
                    "name": "昆明南站",
                    "info": "云南省昆明市呈贡区",
                    "location": {
                        "lng": 102.82350289646942,
                        "lat": 24.921101389540603
                    }
                }
            ]
        }


    ]
};